# Problem set 3: Loading and structuring data from Denmark Statistics

[<img src="https://mybinder.org/badge_logo.svg">](https://mybinder.org/v2/gh/NumEconCopenhagen/exercises-2019/master?urlpath=lab/tree/PS3/problem_set_3.ipynb)

In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('seaborn')
import pandas as pd
import ipywidgets as widgets

# Tasks

## Create a pandas DataFrame

Modify the code below such that *income* and *consumption* are variables in the *dt* DataFrame.

In [2]:
np.random.seed(1999)
 
N = 100
mydata = {}
mydata['id'] = range(N)
income = np.exp(np.random.normal(size=N))
consumption = np.sqrt(income)
mydata['income']=income
mydata['consumption']=consumption

dt = pd.DataFrame(mydata)
dt.head()

   id    income  consumption
0   0  0.727981     0.853218
1   1  1.997831     1.413447
2   2  0.276823     0.526140
3   3  1.481931     1.217346
4   4  1.235904     1.111712

**Answer:**

In [3]:
np.random.seed(1999)

N = 100
mydata = {}
mydata['id'] = range(N)
mydata['income'] = np.exp(np.random.normal(size=N))
mydata['consumption'] = np.sqrt(mydata['income'])

dt_true = pd.DataFrame(mydata)
dt_true.head()

   id    income  consumption
0   0  0.727981     0.853218
1   1  1.997831     1.413447
2   2  0.276823     0.526140
3   3  1.481931     1.217346
4   4  1.235904     1.111712

## Create new variable

Add a new variable *ratio* which is the ratio of consumption to income.

In [4]:
dt['ratio']=consumption/income
dt.head()

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.526140  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

**Answer:**

In [5]:
dt_true['ratio'] = dt_true['consumption']/dt_true['income']
dt_true.head()

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.526140  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

## Summary statistics

Produce summary statistics using `.describe()`.

In [6]:
dt.describe()

               id      income  consumption       ratio
count  100.000000  100.000000   100.000000  100.000000
mean    49.500000    1.415547     1.087844    1.117517
std     29.011492    1.322203     0.484238    0.525452
min      0.000000    0.108402     0.329245    0.351134
25%     24.750000    0.529323     0.727545    0.752310
50%     49.500000    0.981178     0.990533    1.009580
75%     74.250000    1.768211     1.329572    1.374491
max     99.000000    8.110612     2.847914    3.037255

**Answer:**

In [7]:
dt_true.describe()

               id      income  consumption       ratio
count  100.000000  100.000000   100.000000  100.000000
mean    49.500000    1.415547     1.087844    1.117517
std     29.011492    1.322203     0.484238    0.525452
min      0.000000    0.108402     0.329245    0.351134
25%     24.750000    0.529323     0.727545    0.752310
50%     49.500000    0.981178     0.990533    1.009580
75%     74.250000    1.768211     1.329572    1.374491
max     99.000000    8.110612     2.847914    3.037255

## Indexing

Select everybody with an income above 1.

In [8]:
dt.loc[dt['income']>1].head()

   id    income  consumption     ratio
1   1  1.997831     1.413447  0.707490
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513
6   6  2.574032     1.604379  0.623294
7   7  2.475478     1.573365  0.635580

**Answer:**

In [9]:
I = dt_true['income'] > 1
dt_true.loc[I, :].head()

   id    income  consumption     ratio
1   1  1.997831     1.413447  0.707490
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513
6   6  2.574032     1.604379  0.623294
7   7  2.475478     1.573365  0.635580

Select everybody with an income *above* 1 and a ratio *above* 0.7.

In [10]:
r_bool = dt['ratio']>0.7
i_bool = dt['income']>1

dt.loc[r_bool & i_bool].head()

    id    income  consumption     ratio
1    1  1.997831     1.413447  0.707490
3    3  1.481931     1.217346  0.821459
4    4  1.235904     1.111712  0.899513
11  11  2.031708     1.425380  0.701567
18  18  1.280235     1.131475  0.883802

**Answer:**

In [11]:
I = (dt_true['income'] > 1) & (dt_true['ratio'] > 0.7)
dt_true.loc[I].head()

    id    income  consumption     ratio
1    1  1.997831     1.413447  0.707490
3    3  1.481931     1.217346  0.821459
4    4  1.235904     1.111712  0.899513
11  11  2.031708     1.425380  0.701567
18  18  1.280235     1.131475  0.883802

Set consumption equal to 0.5 if income is less than 0.5.

In [12]:
dt.loc[dt['income']<0.5,['consumption']]=0.5
dt['consumption'].mean() # <- compare with answer

1.075479712048503

In [13]:
dt.loc[dt['income']<0.5,['consumption']]=0.5
dt['consumption'].mean() # <- compare with answer

1.075479712048503

**Answer:**

In [14]:
I = (dt_true['income'] < 0.5)
dt_true.loc[I,['consumption']] = 0.5
dt_true['consumption'].mean()

1.075479712048503

Set consumption equal to income if income is less than 0.5.

In [15]:
dt.loc[dt['income']<0.5,['consumption']]=dt['income']
dt['consumption'].mean() # <- compare with answer

1.0337728690050052

**Answer:**

In [16]:
I = (dt_true['income'] < 0.5)
dt_true.loc[I,['consumption']] = dt_true.loc[I,['income']].values
dt_true['consumption'].mean()

1.0337728690050052

## Dropping

Drop the *ratio* variable and all rows with an income above 1.5. After this, also drop the first 5 rows.

In [17]:
print(f'before: {dt.shape[0]} observations, {dt.shape[1]} variables')
dt.drop(columns='ratio', inplace=True)
dt.drop(dt[dt['income']>1.5].index,inplace=True)
dt.drop(dt.loc[:5].index, inplace=True)
print(f'after: {dt.shape[0]} observations, {dt.shape[1]} variables')

before: 100 observations, 4 variables
after: 65 observations, 3 variables

**Answer:**

In [18]:
dt_alt = dt_true.copy()

print(f'before: {dt_true.shape[0]} observations, {dt_true.shape[1]} variables')
dt_true.drop('ratio',axis=1,inplace=True)
I = dt_true['income'] > 1.5
dt_true.drop(dt_true[I].index,inplace=True)
dt_true.drop(dt_true.loc[:5].index,inplace=True)
print(f'after: {dt_true.shape[0]} observations, {dt_true.shape[1]} variables')

# alternative: keep where I is false
del dt_alt['ratio']
I = dt_alt['income'] > 1.5
dt_alt = dt_alt[~I]
dt_alt = dt_alt.iloc[5:,:]
print(f'after (alt): {dt_alt.shape[0]} observations, {dt_alt.shape[1]} variables')

before: 100 observations, 4 variables
after: 65 observations, 3 variables
after (alt): 65 observations, 3 variables

## Renaming

Rename *consumption* to *cons* and *income* to *inc*.

In [19]:
dt.rename(columns={'consumption':'con','income':'inc'},inplace=True)
dt.head()

    id       inc       con
8    8  0.582074  0.762938
10  10  0.932044  0.965424
12  12  0.356952  0.356952
13  13  0.379825  0.379825
16  16  0.700896  0.837195

**Answer:**

In [20]:
dt_true.rename(columns={'income':'inc','consumption':'con'},inplace=True)
dt_true.head()

    id       inc       con
8    8  0.582074  0.762938
10  10  0.932044  0.965424
12  12  0.356952  0.356952
13  13  0.379825  0.379825
16  16  0.700896  0.837195

## Functions (if it was covered in the lecture)

Correct the wrong lines so that `assets_1 = assets_2 = assets_3 = assets_4`.

In [32]:
def assets_row_by_row(x,R,Y):
    return R*(x['inc']-x['con'])+Y
    
def assets_all_at_once(income,consumption,R,Y):
    return R*(income-consumption)+Y

def assets_adj(assets,R,Y):
    assets = R*assets
    assets = assets+Y
    
R = 1.2 # return rate
Y = 1 # income
try:
    dt['assets_1'] = R*(dt['inc']-dt['con'])+Y
    dt['assets_2'] = dt.apply(assets_row_by_row,axis=1,args=(R,Y))
    dt['assets_3'] = assets_all_at_once(dt['inc'].values,dt['con'].values,R,Y)
    dt['assets_4'] = dt['inc']-dt['con']
    assets_adj(dt['assets_4'],R,Y)
except:
    print('failed')
dt.head()

    id       inc       con  assets_1  assets_2  assets_3  assets_4
8    8  0.582074  0.762938  0.782963  0.782963  0.782963 -0.180864
10  10  0.932044  0.965424  0.959943  0.959943  0.959943 -0.033380
12  12  0.356952  0.356952  1.000000  1.000000  1.000000  0.000000
13  13  0.379825  0.379825  1.000000  1.000000  1.000000  0.000000
16  16  0.700896  0.837195  0.836441  0.836441  0.836441 -0.136299

**Answer:**

In [34]:
dt.head()

    id       inc       con  assets_1  assets_2  assets_3  assets_4
8    8  0.582074  0.762938  0.782963  0.782963  0.782963 -0.180864
10  10  0.932044  0.965424  0.959943  0.959943  0.959943 -0.033380
12  12  0.356952  0.356952  1.000000  1.000000  1.000000  0.000000
13  13  0.379825  0.379825  1.000000  1.000000  1.000000  0.000000
16  16  0.700896  0.837195  0.836441  0.836441  0.836441 -0.136299

In [35]:
def assets_row_by_row(x,R,Y):
    return R*(x['inc']-x['con'])+Y
    
def assets_all_at_once(income,consumption,R,Y):
    return R*(income-consumption)+Y

def assets_adj(assets,R,Y):
    assets *= R
    assets += Y

R = 1.2 # return rate
Y = 1 # income
dt_true['assets_1'] = R*(dt_true['inc']-dt_true['con'])+Y
dt_true['assets_2'] = dt_true.apply(assets_row_by_row,axis=1,args=(R,Y))
dt_true['assets_3'] = assets_all_at_once(dt_true['inc'].values,dt_true['con'].values,R,Y)
dt_true['assets_4'] = dt_true['inc']-dt_true['con']
assets_adj(dt_true['assets_4'],R,Y)

dt_true.head()

    id       inc       con  assets_1  assets_2  assets_3  assets_4
8    8  0.582074  0.762938  0.782963  0.782963  0.782963  0.782963
10  10  0.932044  0.965424  0.959943  0.959943  0.959943  0.959943
12  12  0.356952  0.356952  1.000000  1.000000  1.000000  1.000000
13  13  0.379825  0.379825  1.000000  1.000000  1.000000  1.000000
16  16  0.700896  0.837195  0.836441  0.836441  0.836441  0.836441

# Problem

Load the data set in *data/NAH1_pivoted.xlsx* and clean and structure it such that the `plot_timeseries(dataframe)` below can be run and produce an interactive figure.

In [96]:
def _plot_timeseries(dataframe, variable, years):
    
    fig = plt.figure(dpi=100)
    ax = fig.add_subplot(1,1,1)
    
    dataframe.loc[:,['year']] = pd.to_numeric(dataframe['year'])
    I = (dataframe['year'] >= years[0]) & (dataframe['year'] <= years[1])
    
    x = dataframe.loc[I,'year']
    y = dataframe.loc[I,variable]
    ax.plot(x,y)
    
    ax.set_xticks(list(range(years[0], years[1] + 1, 5)))    
    
def plot_timeseries(dataframe):
    
    widgets.interact(_plot_timeseries, 
    dataframe = widgets.fixed(dataframe),
    variable = widgets.Dropdown(
        description='variable', 
        options=['Y','C','G','I','X','M'], 
        value='Y'),
    years=widgets.IntRangeSlider(
        description="years",
        min=1966,
        max=2018,
        value=[1980, 2018],
        continuous_update=False,
    )                 
);

**Hint 1:** You can base your renaming on this dictionary:

In [97]:
rename_dict = {}
rename_dict['P.1 Output'] = 'Y'
rename_dict['P.3 Final consumption expenditure'] = 'C'
rename_dict['P.3 Government consumption expenditure'] = 'G'
rename_dict['P.5 Gross capital formation'] = 'I'
rename_dict['P.6 Export of goods and services'] = 'X'
rename_dict['P.7 Import of goods and services'] = 'M'

**Hint 2:** You code should have the following structure:

In [98]:
# a. load data set
nah1 = pd.read_excel('data/NAH1_pivoted.xlsx',skiprows=2)

# b. rename variables
rename_dict['Unnamed: 0']='year'
rename_dict['Unnamed: 1']='Price'
nah1.rename(columns=rename_dict,inplace=True)
# c. remove rows where Y is nan
nah1.dropna(subset=['Y'],inplace=True)

# d. correct year column data
# hint, nah1.loc[J,['year']] = nah1.loc[I,['year']].values
J= nah1['Price']=='2010-prices, chained values'
I= nah1['Price']=='Current prices'
nah1.loc[J,['year']] = nah1.loc[I,['year']].values


# e. only keep rows with '2010-prices, chained values'

nah1 = nah1.loc[J]

# f. only keep renamed variables

nah1 = nah1.loc[:,rename_dict.values()]

# g. interactive plot
plot_timeseries(nah1)

interactive(children=(Dropdown(description='variable', options=('Y', 'C', 'G', 'I', 'X', 'M'), value='Y'), Int…

In [99]:
nah1.head()

,Y,C,G,I,X,M,year,Price
1,1089347.0,549491.0,171307.0,127631.0,123594.0,112171.0,1966,"2010-prices, chained values"
3,1124579.0,588094.0,184983.0,133749.0,128182.0,120028.0,1967,"2010-prices, chained values"
5,1162778.0,612327.0,195664.0,142242.0,140746.0,127670.0,1968,"2010-prices, chained values"
7,1239121.0,649337.0,209375.0,164447.0,149184.0,144021.0,1969,"2010-prices, chained values"
9,1282852.0,671805.0,222350.0,168129.0,154880.0,157151.0,1970,"2010-prices, chained values"

**Answer:**

In [100]:
rename_dict = {}
rename_dict['P.1 Output'] = 'Y'
rename_dict['P.3 Final consumption expenditure'] = 'C'
rename_dict['P.3 Government consumption expenditure'] = 'G'
rename_dict['P.5 Gross capital formation'] = 'I'
rename_dict['P.6 Export of goods and services'] = 'X'
rename_dict['P.7 Import of goods and services'] = 'M'

In [101]:
# a. load data set
nah1 = pd.read_excel('data/NAH1_pivoted.xlsx',skiprows=2)

# b. rename variables
rename_dict['Unnamed: 0'] = 'year'
nah1.rename(columns=rename_dict,inplace=True)

# c. remove rows where Y is nan
I = nah1['Y'].notna()
nah1 = nah1[I]

# d. correct year column data
I = nah1['year'].notna()
J = nah1['year'].isna()
nah1.loc[J,['year']] = nah1.loc[I,['year']].values

# e. only keep rows with '2010-prices, chained values'
I = nah1['Unnamed: 1'] == '2010-prices, chained values'
nah1 = nah1[I]

# f. only keep renamed variables
nah1 = nah1.loc[:,['year','Y','C','G','I','X','M']]
nah1.head()

   year          Y         C         G         I         X         M
1  1966  1089347.0  549491.0  171307.0  127631.0  123594.0  112171.0
3  1967  1124579.0  588094.0  184983.0  133749.0  128182.0  120028.0
5  1968  1162778.0  612327.0  195664.0  142242.0  140746.0  127670.0
7  1969  1239121.0  649337.0  209375.0  164447.0  149184.0  144021.0
9  1970  1282852.0  671805.0  222350.0  168129.0  154880.0  157151.0

In [102]:
plot_timeseries(nah1)

interactive(children=(Dropdown(description='variable', options=('Y', 'C', 'G', 'I', 'X', 'M'), value='Y'), Int…

# Extra problems

## Extend interactive plot

Extend the interactive plot with a choice of *real* vs *nominal*.

In [106]:
def _plot_timeseries(dataframe, variable, years, price):
    
    fig = plt.figure(dpi=100)
    ax = fig.add_subplot(1,1,1)
    
    # Choose prices:
    dataframe = dataframe[(dataframe['Price']==price)]
    
    dataframe.loc[:,['year']] = pd.to_numeric(dataframe['year'])
    I = (dataframe['year'] >= years[0]) & (dataframe['year'] <= years[1])
    
    x = dataframe.loc[I,'year']
    y = dataframe.loc[I,variable]
    ax.plot(x,y)
    
    ax.set_xticks(list(range(years[0], years[1] + 1, 5)))    
    
def plot_timeseries(dataframe):
    
    widgets.interact(_plot_timeseries, 
    dataframe = widgets.fixed(dataframe),
    variable = widgets.Dropdown(
        description='variable', 
        options=['Y','C','G','I','X','M'], 
        value='Y'),
    years=widgets.IntRangeSlider(
        description="years",
        min=1966,
        max=2018,
        value=[1980, 2018],
        continuous_update=False,
    ),
    price= widgets.Dropdown(
        description='Prices',
        options = ['2010-prices, chained values','Current prices'],
        value = '2010-prices, chained values'
    )
);

In [107]:
rename_dict = {}
rename_dict['P.1 Output'] = 'Y'
rename_dict['P.3 Final consumption expenditure'] = 'C'
rename_dict['P.3 Government consumption expenditure'] = 'G'
rename_dict['P.5 Gross capital formation'] = 'I'
rename_dict['P.6 Export of goods and services'] = 'X'
rename_dict['P.7 Import of goods and services'] = 'M'

In [108]:
# a. load data set
nah1 = pd.read_excel('data/NAH1_pivoted.xlsx',skiprows=2)

# b. rename variables
rename_dict['Unnamed: 0']='year'
rename_dict['Unnamed: 1']='Price'
nah1.rename(columns=rename_dict,inplace=True)
# c. remove rows where Y is nan
nah1.dropna(subset=['Y'],inplace=True)

# d. correct year column data
# hint, nah1.loc[J,['year']] = nah1.loc[I,['year']].values
J= nah1['Price']=='2010-prices, chained values'
I= nah1['Price']=='Current prices'
nah1.loc[J,['year']] = nah1.loc[I,['year']].values

# f. only keep renamed variables

nah1 = nah1.loc[:,rename_dict.values()]

# g. interactive plot
plot_timeseries(nah1)

interactive(children=(Dropdown(description='variable', options=('Y', 'C', 'G', 'I', 'X', 'M'), value='Y'), Int…

## New data set

Load data from an Excel or CSV file you have downloaded from e.g. [Statistikbanken.dk](https://www.statistikbanken.dk/). Clean, structure and present the data as you seem fit.